app/views/home/index.html.erb

SELECT "posts".* FROM "posts"
---
				<ul>
					<li><span class="indicator">Happs</span><br/><span class="count"> <%= @user.posts.count %> </span></li>