app/views/posts/index.html.erb

	<div class="feed">
		<span class="letters"><%= happ.user.happername.chars.first %></span>
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 1]]