app/views/posts/new.html.erb

  <%= f.label :Message %> : <%= f.text_area :text %> <br/>
  <%= f.label :Happer %> :<%= f.select :user, options_from_collection_for_select(@users, "id", "email"), :prompt => "Happer" %><br/>
---
SELECT "users".* FROM "users"