app/controllers/home_controller.rb

SELECT "users".* FROM "users"
SELECT "posts".* FROM "posts"
---
	def index
		@Happers = User.all
		@Happs = Post.all