app/controllers/posts_controller.rb

  def new
    @users = User.all
---
SELECT "users".* FROM "users"

  def create
    @post = Post.new(happ_params)
    @post.user_id = current_user.id;

    @post.save
---
INSERT INTO "posts" ("created_at", "text", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", "2014-12-09 08:42:07.285086"], ["text", "dfdjbf"], ["updated_at", "2014-12-09 08:42:07.285086"], ["user_id", 1]]

  def delete
      session[:return_to] ||= request.referer
      @posts = Post.all
      @post = Post.find(params[:id])
      @post.destroy
---
SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 1]]