app/controllers/users_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."id" = 1  ORDER BY "users"."id" ASC LIMIT 1
SELECT  "posts".* FROM "posts"  WHERE "posts"."user_id" = 1 LIMIT 1
---
  def show
  	@user = User.find(params[:id])
  	@users = User.all
	@posts = @user.posts

	@hashtags_array = []
			@feed_items = current_user.feed

			hashtags = Post.all